In [1]:
import pandas as pd
q_df = pd.DataFrame([['male', 'teacher'], ['male', 'engineer'], ['female', None], ['female', 'engineer']])

In [2]:
q_df.columns=['Sex','Profession']

In [3]:
q_df

      Sex Profession
0    male    teacher
1    male   engineer
2  female       None
3  female   engineer

In [10]:
a=q_df.fillna('others')

In [11]:
a

      Sex Profession
0    male    teacher
1    male   engineer
2  female     others
3  female   engineer

In [13]:
b=pd.get_dummies(a[['Profession']])

In [14]:
b

   Profession_engineer  Profession_others  Profession_teacher
0                    0                  0                   1
1                    1                  0                   0
2                    0                  1                   0
3                    1                  0                   0

In [21]:
a=pd.concat([a,b],axis=1)

In [17]:
a

,Sex,Profession,Profession_engineer,Profession_others,Profession_teacher
0,male,teacher,0,0,1
1,male,engineer,1,0,0
2,female,others,0,1,0
3,female,engineer,1,0,0